Ran Plan for dir: `projects/dev` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/goboolean/infrastructure/92/default/projects/dev/default.tfplan\"" in "/root/.atlantis/repos/goboolean/infrastructure/92/default/projects/dev": exit status 1
module.service.google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=goboolean-448812/cloudresourcemanager.googleapis.com]
module.service.google_project_service.services["container.googleapis.com"]: Refreshing state... [id=goboolean-448812/container.googleapis.com]
module.gcs.google_storage_bucket.terraform_state: Refreshing state... [id=goboolean-terraform-state]
module.gce.google_compute_address.static_ip: Refreshing state... [id=projects/goboolean-448812/regions/asia-northeast3/addresses/atlantis-static-ip]
module.gce.google_compute_firewall.allow_http_https: Refreshing state... [id=projects/goboolean-448812/global/firewalls/allow-http-https]
module.iam.google_service_account.atlantis: Refreshing state... [id=projects/goboolean-448812/serviceAccounts/atlantis@goboolean-448812.iam.gserviceaccount.com]
module.service.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=goboolean-448812/compute.googleapis.com]
module.service.google_project_service.services["serviceusage.googleapis.com"]: Refreshing state... [id=goboolean-448812/serviceusage.googleapis.com]
module.service.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=goboolean-448812/iam.googleapis.com]
module.iam.google_project_iam_member.gke_admin: Refreshing state... [id=goboolean-448812/roles/container.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.acme.tls_private_key.private_key: Refreshing state... [id=3b6fbbc04df1b62ea59e2ed339f7bef7243ccf98]
module.iam.google_project_iam_member.iam_admin: Refreshing state... [id=goboolean-448812/roles/resourcemanager.projectIamAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.service_account_user: Refreshing state... [id=goboolean-448812/roles/iam.serviceAccountUser/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_storage_bucket_iam_member.terraform_state_access: Refreshing state... [id=b/goboolean-terraform-state/roles/storage.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.storage_admin: Refreshing state... [id=goboolean-448812/roles/storage.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.compute_instance_admin: Refreshing state... [id=goboolean-448812/roles/compute.instanceAdmin.v1/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.service_account_admin: Refreshing state... [id=goboolean-448812/roles/iam.serviceAccountAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.owner: Refreshing state... [id=goboolean-448812/roles/owner/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.compute_network_admin: Refreshing state... [id=goboolean-448812/roles/compute.networkAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.gce.google_compute_instance.default: Refreshing state... [id=projects/goboolean-448812/zones/asia-northeast3-a/instances/atlantis]
module.gke.data.google_client_config.default: Reading...
module.gke.data.google_client_config.default: Read complete after 0s [id=projects/"goboolean-448812"/regions/"asia-northeast3"/zones/<null>]
module.gke.data.google_container_engine_versions.gke_version: Reading...
module.gke.google_compute_network.vpc: Refreshing state... [id=projects/goboolean-448812/global/networks/goboolean-448812-vpc]
module.gke.data.google_container_engine_versions.gke_version: Read complete after 0s [id=2025-02-01 04:38:51.989305081 +0000 UTC]
module.gke.google_compute_subnetwork.subnet: Refreshing state... [id=projects/goboolean-448812/regions/asia-northeast3/subnetworks/goboolean-448812-subnet]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/goboolean-448812/locations/asia-northeast3-a/clusters/goboolean-448812-gke]
module.gke.google_container_node_pool.primary_nodes: Refreshing state... [id=projects/goboolean-448812/locations/asia-northeast3-a/clusters/goboolean-448812-gke/nodePools/goboolean-448812-gke]
module.acme.acme_registration.reg: Refreshing state... [id=https://acme-staging-v02.api.letsencrypt.org/acme/acct/182146964]
module.namespace.kubernetes_namespace.harbor: Refreshing state... [id=harbor]
module.namespace.kubernetes_namespace.argocd: Refreshing state... [id=argocd]
module.namespace.kubernetes_namespace.vault: Refreshing state... [id=vault]
module.namespace.kubernetes_namespace.fetch-system: Refreshing state... [id=fetch-system]
module.namespace.kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
module.istio.helm_release.istio_base: Refreshing state... [id=istio-base]
module.vault.helm_release.vault: Refreshing state... [id=vault]
module.harbor.helm_release.harbor: Refreshing state... [id=harbor]
module.cert_manager.kubernetes_secret.cloudflare_api_token: Refreshing state... [id=cert-manager/cloudflare-api-token-secret]
module.cert_manager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.acme.acme_certificate.certificate: Refreshing state... [id=224e11bc-998b-e278-dd24-d91d3595adf3]
module.istio.helm_release.istiod: Refreshing state... [id=istiod]
module.istio.helm_release.istio_ingressgateway: Refreshing state... [id=istio-ingressgateway]
module.istio.kubernetes_manifest.istio_gateway: Refreshing state...
module.istio.data.kubernetes_service.istio_ingressgateway: Reading...
module.harbor.kubernetes_manifest.harbor_gateway: Refreshing state...
module.istio.data.kubernetes_service.istio_ingressgateway: Read complete after 0s [id=istio-system/istio-ingressgateway]
module.cert_manager.kubernetes_manifest.cluster_issuer: Refreshing state...
module.vault.kubernetes_manifest.vault_gateway: Refreshing state...
module.cloudflare.cloudflare_dns_record.istio-gateway: Refreshing state... [id=5b3805bf479bd12a29aad2877a6cfdfa]
module.cert_manager.kubernetes_manifest.wildcard_certificate: Refreshing state...

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.namespace.kubernetes_namespace.argocd has been deleted
  - resource "kubernetes_namespace" "argocd" {
        id                               = "argocd"
        # (1 unchanged attribute hidden)

      - metadata {
          - name             = "argocd" -> null
            # (6 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.argocd.data.kustomization_build.argocd will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kustomization_build" "argocd" {
      + id        = (known after apply)
      + ids       = (known after apply)
      + ids_prio  = (known after apply)
      + manifests = (known after apply)
      + path      = "../../modules/infra/argocd/base"
    }

  # module.namespace.kubernetes_namespace.argocd will be created
  + resource "kubernetes_namespace" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid for_each argument
│ 
│   on ../../modules/infra/argocd/main.tf line 7, in resource "kustomization_resource" "p0":
│    7:   for_each = data.kustomization_build.argocd.ids_prio[0]
│     ├────────────────
│     │ data.kustomization_build.argocd.ids_prio[0] is a set of string, known only after apply
│ 
│ The "for_each" set includes values derived from resource attributes that
│ cannot be determined until apply, and so Terraform cannot determine the
│ full set of keys that will identify the instances of this resource.
│ 
│ When working with unknown values in for_each, it's better to use a map
│ value where the keys are defined statically in your configuration and where
│ only the values contain apply-time results.
│ 
│ Alternatively, you could use the -target planning option to first apply
│ only the resources that the for_each value depends on, and then apply a
│ second time to fully converge.
╵
Releasing state lock. This may take a few moments...

```
</details>

